
#for i in range(-15, 6, 2):
 #   print(i)

#print(sum(-10, 5))
#print(abs(-10, -18)
#print(max[-10, 10])
#print(pow(15, 1/4))



#my_fan = lambda p1, p2 : p1 + p2

#print(my_fan(2, 3))




def summa_chisel(number1, number2=1, my_list=[]):
"""
 #   result = ' '.join(number1) * number2
  #  return result
    #for i in number1:
     #   result +=i """

    #for i in number2:
     #   result +=i

#my_list = [1, 2, 3, 4, 5]
#my_str = map(str, my_list)

#user_digits = [1, 2, 3, 4, 5]                    #input('Enter numbers, using space: ').split(' ')
#user_list =   [1, 2, 3, 4, 5]         #map(int, user_digits)


#result = summa_chisel (my_str, 20, my_list)

#print(result)
#print(summa_chisel(my_list))
 Задание 3 - деф, внутри функция макс.
4- лсожение и уменьшение в опр. число раз.
6 взять строку, слово (массив), взять нудевой индекс и сделать его апр.
Надо разделить предложения, используя сплит по определенным знаком